Revit 2027 API
ParameterTypeId.BendingDetailTypeShowAngularDimensionsFor Property
 "Show for Angles"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeShowAngularDimensionsFor { get; }
Public Shared ReadOnly Property BendingDetailTypeShowAngularDimensionsFor As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeShowAngularDimensionsFor {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeShowAngularDimensionsFor : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace